In [ ]:
# Second Highest Salary

"""
-- select 
--   max(salary) as SecondHighestSalary from Employee
-- where salary < (select max(salary) from Employee);



-- select ifnull((
--     select distinct(salary) from Employee 
--     order by salary desc 
--     LIMIT 1 OFFSET 1
-- ), null) SecondHighestSalary;


select nullif((select distinct salary from (
   select 
   salary, 
   dense_rank() over (order by salary desc) as rownumber from Employee
   ) temp where temp.rownumber=2), null) SecondHighestSalary;

"""

In [ ]:
# Department Top Three Salaries
"""
with cte as (
  select 
    d.name as Department,
    e.name as Employee, 
    e.salary as Salary
  from Employee e join Department d on e.departmentId=d.id
),
cte1 as (
  select 
    *, 
    dense_rank() over(partition by Department order by Salary desc) as rownumber
  from cte
)
select Department, Employee, Salary from cte1 where rownumber <= 3;
"""